artillery/test_Get-fakerGenerateUser.yml
config:
  # base url 정의 (우리는 domain을 작성)
  target: 'https://ginger-sparta.duckdns.org'

  phases:
    # 부하테스트 시간 (초)
    - duration: 60
      # 부하테스트 동안의 사용자 수 (초당 요청 수)
      arrivalRate: 1
      name: Get-fakerGenerateUser
# 부하 테스트 시나리오
scenarios:
  # 시나리오 정의
  - name: 'Get-fakerGenerateUser'
    flow:
      - get:
          url: '/api/faker/generate-Ten-fake-user'